In [1]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from collections import defaultdict
from sklearn.preprocessing import MinMaxScaler

In [2]:
df1 = pd.read_csv('D://Documenti//Università//Informatica Umanistica//DMII//occupancy_data//datatraining.txt', skipinitialspace=True, na_values='?', 
                 keep_default_na=True)
df2 = pd.read_csv('D://Documenti//Università//Informatica Umanistica//DMII//occupancy_data//datatest2.txt', skipinitialspace=True, na_values='?', 
                 keep_default_na=True,)

df = pd.concat([df1,df2], ignore_index = True)
pd.to_datetime(df['date'], format='%Y-%m-%d %H:%M:%S')

0       2015-02-04 17:51:00
1       2015-02-04 17:51:59
2       2015-02-04 17:53:00
3       2015-02-04 17:54:00
4       2015-02-04 17:55:00
                ...
17890   2015-02-18 09:15:00
17891   2015-02-18 09:16:00
17892   2015-02-18 09:16:59
17893   2015-02-18 09:17:59
17894   2015-02-18 09:19:00
Name: date, Length: 17895, dtype: datetime64[ns]

In [3]:
dates = pd.to_datetime(df['date'], infer_datetime_format=True)
df['day'] = dates.dt.day
df['absH'] = dates.dt.hour

In [4]:
df.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy,day,absH
0,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1,4,17
1,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1,4,17
2,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1,4,17
3,2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1,4,17
4,2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1,4,17

In [5]:
del df['Light']
del df['Humidity']
del df['CO2']
del df['HumidityRatio']
del df['Occupancy']
del df['date']

In [6]:
df.head()

   Temperature  day  absH
0        23.18    4    17
1        23.15    4    17
2        23.15    4    17
3        23.15    4    17
4        23.10    4    17

In [7]:
df['day'].unique()

array([ 4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
      dtype=int64)

In [8]:
df[df['day'] == 18]['absH'].unique()

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [9]:
a = pd.DataFrame()

In [10]:
for n in df['day'].unique():
    if n != 4 and n != 10 and n != 11 and n !=18:
        for m in df[df['day'] == n]['absH'].unique():
            b = df[df.day==n][df.absH==m]
            del b['day']
            del b['absH']
            b = b.reset_index(drop=True)
            b = b.transpose()
            
            a = pd.concat([a,b], ignore_index = True)

c:\users\gdm17\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

In [11]:
a.head()

,0,1,2,3,4,5,6,7,8,9,...,51,52,53,54,55,56,57,58,59,60
0,21.245,21.245,21.26,21.245,21.245,21.29,21.245,21.290000,21.29,21.290000,...,21.050,21.1,21.0,21.1,21.1,21.1,21.1,21.10,21.100000,NaN
1,21.100,21.100,21.05,21.100,21.100,21.10,21.100,21.150000,21.10,21.125000,...,21.125,21.1,21.1,21.1,21.1,21.1,21.1,21.05,21.100000,21.10
2,21.000,21.000,21.00,21.000,21.000,21.00,21.000,21.000000,21.00,21.000000,...,21.025,21.0,21.0,21.0,21.0,21.0,21.0,21.00,NaN,NaN
3,21.000,21.000,21.00,21.000,21.000,21.00,20.945,20.963333,20.89,20.926667,...,21.000,21.0,21.0,21.0,21.0,21.0,21.0,21.00,21.000000,NaN
4,21.000,21.000,21.00,20.890,20.945,21.00,20.890,20.890000,20.89,20.890000,...,21.000,21.0,21.0,21.0,21.0,21.0,21.0,21.00,20.963333,20.89

Come puoi vedere nella colonna 59 e 60 sono presenti dei NaN. Questo perché "concat" fa un lavoro particolare: prende tutte le colonne dei 2 dataset e li unisce, se due colonne hanno lo stesso nome li fonde. 
Nel nostro caso alcune ore hanno solo 58 record, quindi nella colonna "59" e "60" CONCAT inserisce automaticamente dei NAN.
Per non riscontrare problemi ho eliminato le colonne 59 e 60 ed ho anche eliminato i giorni 4, 10 e 11 che sono "difettosi" in quanto hanno meno record rispetto agli altri.

Per la stessa ragione di prima, non ho potuto mettere come nome delle colonne la data del record o concat avrebbe riempito il dataset di NaN.

Detto questo, fanculo Guidotti di merda.

In [12]:
del a[59]
del a[60]

In [15]:
a.shape

(264, 59)

In [17]:
a.to_csv('/Users/gdm17/Desktop/Temperature.csv')